packages/fxa-auth-server/test/local/payments/fixtures/stripe/subscription_created.json

{
  "id": "evt_1GB5YwKb9q6OnNsL5j2KbWmG",
  "object": "event",
  "api_version": "2019-12-03",
  "created": 1581453749,
  "data": {
    "object": {
      "id": "sub_GiX3TpyO37x5BW",
      "object": "subscription",
      "application_fee_percent": null,
      "billing_cycle_anchor": 1581453748,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "collection_method": "charge_automatically",
      "created": 1581453748,
      "current_period_end": 1581540148,
      "current_period_start": 1581453748,
      "customer": "cus_GiX3P6izX4lG5p",
      "days_until_due": null,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_GiWcAgBaWUwwZx",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1581453749,
            "metadata": {},
            "plan": {
              "id": "plan_GWScEDK6LT8cSV",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 199,
              "amount_decimal": "199",
              "billing_scheme": "per_unit",
              "created": 1578671226,
              "currency": "usd",
              "interval": "day",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
                "downloadURL": "https://fpn.firefox.com/vpn/download?utm_medium=email&utm_source=email&utm_campaign=subscription-download",
                "webIconURL": "https://accounts-static.cdn.mozilla.net/product-icons/fpn.svg"
              },
              "nickname": "daily",
              "product": "prod_FUUNYnlDso7FeB",
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "quantity": 1,
            "subscription": "sub_GiWcHwJbYsxS9q",
            "tax_rates": []
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_GiWcHwJbYsxS9q"
      },
      "latest_invoice": "in_1GB5YuKb9q6OnNsL1vebOMR7",
      "livemode": false,
      "metadata": {},
      "next_pending_invoice_item_invoice": null,
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "id": "plan_GWScEDK6LT8cSV",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 199,
        "amount_decimal": "199",
        "billing_scheme": "per_unit",
        "created": 1578671226,
        "currency": "usd",
        "interval": "day",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
          "downloadURL": "https://fpn.firefox.com/vpn/download?utm_medium=email&utm_source=email&utm_campaign=subscription-download",
          "webIconURL": "https://accounts-static.cdn.mozilla.net/product-icons/fpn.svg"
        },
        "nickname": "daily",
        "product": "prod_FUUNYnlDso7FeB",
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": 1581453748,
      "status": "active",
      "tax_percent": null,
      "trial_end": null,
      "trial_start": null
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": "req_OrSeVJZfnPXQ6m",
    "idempotency_key": "da9a8474bbf04b02bb137b5814ddc2c9"
  },
  "type": "customer.subscription.created"
}
